use food_reboot;


INSERT INTO food_reboot.users (firstname,lastname,email,password_hash,phone)
	VALUES 
	('Vool','Pasha','pasha@gmail.ru','567',7654123),
	('Vogre','Masha','masha@gmail.ru','954',7897654),
	('Yugre','Tanya','tanya@gmail.ru','ghk',7763451),
	('Leegre','Petya','petya@gmail.ru','yds',7431098),
	('Peeke','John','john@gmail.ru','ikl',7634056),
	('Looker','Keven','keven@gmail.ru','jnb',7098123),
	('Misher','Mitya','mitya@gmail.ru','jue',7765345),
	('Hassie','Davis','davis@gmail.ru','y3w',7890456),
	('Royal','Marks','marks@gmail.ru','uj8',7980675),
	('Cool','Sasha','sasha@gmail.ru','123',7654345);


INSERT INTO food_reboot.profiles (gender,birthday,weight,height)
	VALUES 
	('m','1976-11-08',78,175),
	('f','1994-06-15',62,165),
	('f','1973-11-16',67,168),
	('m','1994-02-07',88,180),
	('m','1991-08-17',73,173),
	('m','1979-08-20',85,178),
	('m','1977-08-16',94,179),
	('m','1978-11-28',79,170),
	('m','1976-02-16',71,176),
	('m','1981-03-05',89,178);


INSERT INTO food_reboot.recipe (id,user_id,name,description)
	VALUES 
	(1,1,'овсяноблин','вкусно'),
	(2,3,'омлет','вкусно'),
	(3,5,'тефтели','вкусно'),
	(4,4,'голубцы','вкусно'),
	(5,7,'салат','вкусно'),
	(6,2,'тушеная курица','вкусно'),
	(7,3,'картофельное пюре','вкусно'),
	(8,6,'макароны с сыром','вкусно'),
	(9,9,'куриный рулет','вкусно'),
	(10,4,'сырники','вкусно'),
	(11,4,'фарш','полуфабрикат');

INSERT INTO food_reboot.products (recipe_id,name)
	VALUES 
	(NULL,'молоко'),
	(NULL,'яйцо'),
	(NULL,'овсянка'),
	(NULL,'свинина'),
	(NULL,'лук'),
	(NULL,'морковь'),
	(NULL,'картофель'),
	(NULL,'сыр'),
	(NULL,'творог 5%'),
	(NULL,'помидор'),
	(NULL,'огурец'),
	(NULL,'капуста'),
	(NULL,'масло оливковое'),
	(NULL,'куриное филе'),
	(NULL,'мука'),
	(NULL,'изюм'),
	(NULL,'макароны'),
	(11,'фарш');

INSERT INTO food_reboot.nutrients (id,name)
	VALUES 
	(1,'жиры'),
	(2,'белки'),
	(3,'углеводы'),
	(4,'калорийность'),
	(5,'сахар');


INSERT INTO units (name)
	VALUES 
	('100 гр'),
	('гр'),
	('кг'),
	('порция'),
	('шт');


INSERT INTO food_reboot.product_nutrients (unit_id,product_id,nutrient_id,value)
	VALUES 
	-- молоко
	(1,1,1,3.2),
	(1,1,2,2.9),
	(1,1,3,4.7),
	(1,1,4,59),
	-- яйцо
	(1,2,1,10.9),
	(1,2,2,12.7),
	(1,2,3,0.7),
	(1,2,4,157),
	-- овсянка
	(1,3,1,7.2),
	(1,3,2,11.9),
	(1,3,3,69.3),
	(1,3,4,305),
	-- свинина
	(1,4,1,21.6),
	(1,4,2,16),
	(1,4,3,0),
	(1,4,4,259),
	-- лук
	(1,5,1,0),
	(1,5,2,1.4),
	(1,5,3,10.4),
	(1,5,4,41),
	-- морковь
	(1,6,1,0.1),
	(1,6,2,1.3),
	(1,6,3,6.9),
	(1,6,4,33),
	-- картофель
	(1,7,1,0.4),
	(1,7,2,2),
	(1,7,3,18.1),
	(1,7,4,80),
	-- сыр
	(1,8,1,45),
	(1,8,2,25),
	(1,8,3,2),
	(1,8,4,356),
	-- творог 5%
	(1,9,1,5),
	(1,9,2,6.8),
	(1,9,3,4.2),
	(1,9,4,91),
	-- помидор
	(1,10,1,0.2),
	(1,10,2,1.1),
	(1,10,3,3.8),
	(1,10,4,23),
	-- огурец
	(1,11,1,0.1),
	(1,11,2,0.8),
	(1,11,3,2.6),
	(1,11,4,15),
	-- капуста
	(1,12,1,0.1),
	(1,12,2,1.8),
	(1,12,3,6.8),
	(1,12,4,28),
	-- масло оливковое
	(1,13,1,99.8),
	(1,13,2,0),
	(1,13,3,0),
	(1,13,4,913),
	-- куриное филе
	(1,14,1,1.9),
	(1,14,2,23.6),
	(1,14,3,0.4),
	(1,14,4,113),
	-- мука
	(1,15,1,1),
	(1,15,2,12),
	(1,15,3,67),
	(1,15,4,325),
	-- изюм 
	(1,16,1,0.6),
	(1,16,2,2.9),
	(1,16,3,66),
	(1,16,4,280),
	-- макароны
	(1,17,1,1.3),
	(1,17,2,11),
	(1,17,3,70.5),
	(1,17,4,338);


INSERT INTO food_reboot.recipe_item (recipe_id,product_id,value,unit_id)
	VALUES 
	-- овсяноблин
	(1,1,60,2),
	(1,2,60,2),
	(1,3,25,2),
	-- омлет
	(2,2,2,5),
	(2,1,100,2),
	-- тефтели
	(3,4,300,2),
	(3,5,60,2),
	-- фарш
	(11,4,200,2),
	(11,14,200,2),
	-- голубцы
	(4,18,200,2),
	(4,5,100,2),
	(4,6,100,2),
	(4,12,200,2),
	-- салат
	(5,10,100,2),
	(5,11,100,2),
	(5,13,15,2),
	-- тушеная курица
	(6,14,250,2),
	(6,5,120,2),
	(6,6,120,2),
	-- картофельное пюре
	(7,7,300,2),
	(7,1,50,2),
	-- макароны с сыром
	(8,17,150,2),
	(8,8,25,2),
	-- куриный рулет
	(9,14,400,2),
	(9,5,100,2),
	(9,6,100,2),
	(9,2,120,2),
	-- сырники
	(10,9,250,2),
	(10,2,60,2),
	(10,15,50,2),
	(10,16,40,2);


INSERT INTO food_reboot.meals (user_id,product_id,value,unit_id, meal_time)
	VALUES 
	(5,1,200,2,'2021-02-26 11:53:14'),
	(5,2,60,2,'2021-02-26 11:53:14'),
	(5,7,120,2,'2021-02-28 11:53:14'),
	(5,3,60,2,'2021-02-28 11:53:14'),
	(4,8,30,2,'2021-02-28 11:53:14'),
	(6,10,150,2,'2021-02-28 11:53:14'),
	(7,2,120,2,'2021-02-28 11:53:14'),
	(1,8,40,2,'2021-02-26 11:53:14'),
	(9,10,150,2,'2021-02-28 11:53:14'),
	(3,7,120,2,'2021-02-28 11:53:14'),
	(2,3,60,2,'2021-02-27 11:53:14'),
	(4,8,30,2,'2021-02-25 11:53:14'),
	(6,10,150,2,'2021-02-26 11:53:14'),
	(7,2,120,2,'2021-02-27 11:53:14'),
	(1,8,40,2,'2021-02-28 11:53:14'),
	(9,10,150,2,'2021-02-28 11:53:14'),
	(9,11,150,2,'2021-02-28 11:53:14');


	
